"""Выведите 2 в степени n"""
n = int(input())
print(2 ** n)