"""Напишите программу, которая по данному числу N от 1 до 9 выводит на экран N пингвинов."""
n = int(input())
print('   _~_    ' * n)
print('  (o o)   ' * n)
print(' /  V  \  ' * n)
print('/(  _  )\ ' * n)
print('  ^^ ^^   ' * n)